<?php 
function catNews(){
  return array(
    1 => '白石グループ',
    2 => '白石工業',
    3 => '白石カルシウム',
    4 => '白石中央研究所',
    5 => '採用情報',
  );
}
function category(){
  return array(
    1  => 'ゴム',
    2  => '樹脂',
    3  => 'インキ',
    4  => '塗料',
    5  => '接着剤・シーラント',
    6  => '製紙',
    7  => '食品',
    8  => '農材',
    9  => '畜産',
    10 => '繊維',
    11 => '電子材料',
    12 => '生体・バイオ',
    // 'ゴム',
    // '樹脂',
    // 'インキ',
    // '塗料',
    // '接着剤',
    // '製紙',
    // '食品・衣料品類',
    // '農材',
    // '畜産',
    // '繊維',
    // '電子材料',
    // '生体・バイオ',
  );
}
function catMail(){
  return array(
    1  => 'rubber@shiraishi.co.jp',
    2  => 'plastic@shiraishi.co.jp',
    3  => 'chemical@shiraishi.co.jp',
    4  => 'chemical@shiraishi.co.jp',
    5  => 'chemical@shiraishi.co.jp',
    6  => 'paper@shiraishi.co.jp',
    7  => 'food@shiraishi.co.jp',
    8  => 'agro-material@shiraishi.co.jp',
    9  => 'agro-material@shiraishi.co.jp',
    10 => 'textile@shiraishi.co.jp',
    11 => 'electronics@shiraishi.co.jp',
    12 => 'food@shiraishi.co.jp',
  );
}
function cat_exp(){
  return array(
    1  => 'ゴム種に関わらず、薬品、補強剤、充填剤、軟化剤などの組み合わせと混練⽅法で粘度や硬さを調節が可能で、⾃由⾃在に形作ることができます。<br>
           当社は⽩⽯グループ内の㈱⽩⽯中央研究所や上海東武橡胶中⼼有限公司での材料・配合評価を基に、お客様が望まれている最適な条件を厳選し提案いたします。<br>
           また東南アジアを中⼼とした海外10拠点においても、⽇本国内同様のサービスを提供いたします。',
    2  => 'グローバル化が進むにつれ、お客さまのニーズ(要望)は多様性を増し、さらに複雑なものとなってきています。<br>
           樹脂分野においても生産拠点の海外移転(海外投資)、海外パートナーとの協業、輸入原材料の導入など市場(需要)や競争力を求め、日々変化を続けております。<br>
           国内外を問わず、多くの優れた原材料(機能性の高いフィラー、添加剤、改質剤など)を取り揃え、市場変化、お客さまのニーズに合わせた、より良いサービスを提供いたします。',
    3  => '印刷方式や用途によってさまざまな種類のインキがあり、求められる特性も多種多様です。<br>
           合成炭酸カルシウム、カーボンブラック等の各種無機粉体の他、紫外線吸収剤、増粘剤等の添加剤も幅広く取り揃えております。',
    4  => '塗料は普段の暮らしの中でビル、家、車、看板などさまざまな分野で使われており、私たちの生活を豊かにする役目を担っています。<br>
           その用途や目的によって、樹脂、フィラー、添加剤、顔料などの使用される原料の種類、特性、配合量は大きく異なります。<br>
           合成炭酸カルシウムをはじめとする各種フィラーを中心に目的、用途ごとに粒子径、表面処理、包装形態、コストなどのユーザーニーズに応じたご提案を行っております。',
    5  => '接着剤・シーラントは私たちの暮らしのさまざまな場所で使われています。<br>
           例えば、物が壊れたときの補修用接着剤がそうです。また、戸建て住宅やビル建造物の建築用、自動車・船舶・航空機などにも使用されています。<br>
           多岐にわたるお客様のご要望に応えるため、各種粉体を取り扱っています。',
    6  => '当社では紙パルプ産業で使われる「重質炭酸カルシウム」「軽質炭酸カルシウム」「カオリンクレー」の3大白色顔料を取り扱っています。<br>
           近年ペーパーレス化により国内の紙使用量が減少するなかで、 3大白色顔料の幅広い製品ラインナップを取り揃えることで、多様化するニーズにお応えしています。<br>
           当社は米国ジョージア州にあるTHIELE社のカオリンクレーを取り扱っており、日本及び、中国、インドネシアにおいても販売代理店として活動しております。<br>
           その他の製紙用薬品も扱っております。',
    7  => '当社は、カルシウムを基本にさまざまな食品原料で食の「おいしい」「安全」「健康」を創造します。<br>
           主要商品である炭酸カルシウムは、主に栄養素「カルシウム」の供給源として、安全・安心にこだわった食添GMP工場での製造をベースに、<br>
           独自の技術力で様々な食品に適した形の製品を提供しております。<br>
           また、調味料・品質改良剤分野におきましても、特徴ある商品群と技術力でお客様の商品開発をサポートします。',
    8  => '弊社はメーカー機能を有しており、これまで積み重ねた知識と経験、日々の営業活動から得られる情報をもとに、ユーザーニーズを取り入れた商品開発を行なっています。<br>
           農薬分野では、炭酸カルシウム微粒子が有効成分の「クレフノン」、みかんの浮皮軽減に使われる「セルバイン」に加え、<br>
           柑橘のチャノキイロアザミウマ対策に物理的な作用で効果を発揮する「ホワイトコート」を販売をしております。<br>
           肥料分野では果樹、野菜類に使われる葉面散布肥料を中心に、作物の品質向上を目的とした商品を取り扱っております。<br>
           これらの商品を通じ、少しでも農業の発展に貢献できるよう努力を続けています。',
    9  => '昭和初期の家畜用カルシウム剤「コロイカル」の販売開始以来、長年蓄積してきたノウハウを活かし、<br>
           カルシウムを中心に家畜の健康管理に必要な飼料の開発・製造を行っています。<br>
           ミネラルペレットをはじめ、ビタミン製剤、バイパス油脂製剤、固型塩、各種資材など家畜の生産管理に欠かせない商品を取り扱っており、<br>
           日々の営業活動を通じ、畜産業界に貢献できるよう、努力を続けています。',
    10 => '各種協力工場で原糸から染色・仕上げまで一貫したサプライヤーを持ち、<br>
           密接なリレーションによる技術力、情報収集力を活用して、新商品の提供・開発を推進します。',
    11 => 'テレビやパソコン、スマートフォンといった電子機器は私たちの生活を支え、今やなくてはならない存在になりつつあります。<br>
           こうした電子機器は、日々の暮らしを豊かにしてくれます。<br>
           当社では、そうした電子機器を構成する各種デバイスの性能を向上させる資材を取り扱っています。<br>
           また、時にはお客様と共同で研究し、より価値の高いものを提案しています。',
    12 => '人間の長寿命化やそれに伴うQOL（Quality of life）向上への要求に対して大きな役割を果たすのは、医薬品（＆医薬部外品・化粧品）や医療機器。<br>
           当社では医療機器原料としても使用可能な不純物の少ない高品質のカルシウム製品や、抗菌性のある成分を担持した高機能なカルシウム製品を製造・販売しております。<br>
           お客様の目的・用途に応じた新しいカルシウム素材の開発にも積極的に取り組んでおります。',
  );
}
function material($cat = ''){
  $materials = array(
    1 => array(
    // 'ゴム' => array(
      'NR',
      'IR',
      'SBR',
      'BR',
      'CR',
      'NBR',
      'IIR',
      'EPDM',
      'FKM',
      'CSM',
      'Q',
      'AR、ACM',
    ),
    2 => array(
    // '樹脂' => array(
      '無機フィラー',
      '合成樹脂',
      '添加剤',
      '機能性マスターバッチ',
      'その他',
    ),
    3 => array(
    // 'インキ' => array(
      '新聞',
      'オフセット',
      'グラビア',
      'UV',
    ),
    4 => array(
    // '塗料' => array(
      '溶剤',
      '水系',
      '粉体',
    ),
    5 => array(
    // '接着剤' => array(
      '水系',
      '合成樹脂系',
      '溶剤系',
    ),
    6 => array(
    // '製紙' => array(
      '塗工',
      '内填',
      'その他',
    ),
    7 => array(
    // '食品・衣料品類' => array(
      '食品',
      '食添',
      // 'オーラルケア',
      // '医薬',
      // '医薬部外品',
    ),
    8 => array(
    // '農材' => array(
      '農薬',
      '肥料',
      '資材・その他',
    ),
    9 => array(
    // '畜産' => array(
      '飼料',
      '配合原料',
      '資材・その他',
    ),
    10 => array(
    // '繊維' => array(
      '車両',
      '履物',
      '衣料',
      '手袋',
      '雑貨',
    ),
    11 => array(
    // '電子材料' => array(
      'PCB用資材',
      'CCL用資材',
      '封止材用資材',
      'SRインキ用資材',
      'LED用資材',
    ),
    12 => array(
    // '生体・バイオ' => array(
      '化粧品原料',
      'オーラルケア',
      '医薬向け材料',
      '創薬研究/医療機器原料',
    ),
  );
  if(isset($materials[$cat])) {
    return $materials[$cat];
  } else {
    return $materials;
  }
}
function product($cat = ''){
  $products = array(
    1 => array(
    // 'ゴム' => array(
      'ポリマー',
      '加硫剤（硫黄、有機過酸化物他）',
      '補強剤（カーボンブラック、有機・無機補強材）',
      '軟化剤（プロセスオイル、可塑剤、サブ他）',
      '充填剤（無機・有機充填材）',
      'ゴム薬品（加硫促進剤、老化防止剤、粘着付与剤他）',
      'ゴム用添加剤 （滑材、発泡剤、難燃剤他）',
      'その他配合剤（カップリング剤、帯電防止剤、着色剤他）',
      '製造設備・部品ほか（混練機、押出し機、計量器、試験機他）',
      'その他商品（CMB、カラーMB、熱可塑性エラストマー）',
    ),
    2 => array(
    // '樹脂' => array(
      '合成炭酸カルシウム',
      '重質炭酸カルシウム',
      '板状フィラー',
      'クレー類',
      'シリカ類',
      '軽量化フィラー',
      '難燃フィラー',
      '有機系フィラー',
      'STフィラー',
      '汎用樹脂',
      '再生PVC',
      '紫外線吸収剤',
      '光安定剤',
      '酸化防止剤',
      'MATシリーズ',
      'カスタムグレード',
      '難燃剤',
      '抗菌剤',
      '滑剤',
      '発泡剤',
      '離型剤',
      '防錆剤',
    ),
    3 => array(
    // 'インキ' => array(
      '体質顔料・充填剤',
      '増粘剤',
      '無機黒色顔料',
      '紫外線吸収剤',
      '酸化防止剤',
      '光安定剤',
    ),
    4 => array(
    // '塗料' => array(
      '体質顔料・充填剤',
      // '白色顔料',
      '増粘剤',
      '軽量化剤',
      '艶消し剤',
      '無機黒色顔料',
      '分散剤',
      '紫外線吸収剤',
      '酸化防止剤',
      '光安定剤',
      'シランカップリング剤・架橋剤',
    ),
    5 => array(
    // '接着剤' => array(
      '充填剤・粘度調整剤',
      '脱水剤',
      '軽量化剤',
      '着色剤（トナー）',
      '紫外線吸収剤',
      '酸化防止剤',
      '光安定剤',
      'シランカップリング剤・架橋剤',
      '接着付与剤',
    ),
    6 => array(
    // '製紙' => array(
      'PCC',
      'GCC',
      'カオリン',
      '分散剤',
      '保水剤',
    ),
    7 => array(
    // '食品・衣料品類' => array(
      '食添炭酸カルシウム',
      '各種ミネラル素材',
      '酒類・醗酵調味料',
      'エキス調味料・粉末調味料',
      '品質改良剤・フレーバー',
    ),
    8 => array(
    // '農材' => array(
      'みかん浮皮軽減',
      '銅水和剤の薬害軽減',
      '着色促進',
      'チャノキイロヌザミウマ防除',
      'モモシンクイガ防除',
      'カルシウム補給',
      'カルシウム補給＋α',
      '鮮度保持',
      '追熟資材',
      '温暖化対応',
      '省力化',
    ),
    9 => array(
    // '畜産' => array(
      'カルシウム補給',
      'マグネシウム補給',
      'ミネラル補給',
      'ビタミン補給',
      'エネルギー補給',
      'アミノ酸補給',
      'リン補給',
      '畜産用資材',
      '畜産用機械',
    ),
    10 => array(
    // '繊維' => array(
      '合皮用基布',
      '塩ビ用基布',
      'アッパー用途機能性素材',
      'ライニング用途機能性素材',
    ),
    11 => array(
    // '電子材料' => array(
    ),
    12 => array(
    // '生体・バイオ' => array(
    ),
  );
  if(isset($products[$cat])) {
    return $products[$cat];
  } else {
    return $products;
  }
}
?>